["Summertime\nhttps://t.co/3NisuDOdVg https://t.co/LUvMx9AGPm", "Merci tout le monde 🙏🏼", "Ça sera diffusé en live sur le Twitch de @Doigby . Vendredi on fait un tournoi avec des gamers et d’autres gens cools en live sur le Twitch de @JLTomy . Merci @ASUS_ROG_FR @RaoulBarbet @GrelinArt @_Eddiepurple_ @ASUS_BK_ROG @Fnac @IntelFrance @neolegendparis #CivilisationFighters", "Demain on fait la grande finale de CIVILISATION FIGHTERS sur scène à La Défense Arena. Les gagnants de la tournée, de la Fnac et de la PGW vont s’affronter dans les loges et faire la finale pendant le concert. Le vainqueur remporte une borne d’arcade Civilisation Fighters… https://t.co/JsZP1dPYW3", "Bimbadabim⚫️⚪️⚫️\nLe triple VINYLE de CIVILISATION ÉDITION ULTIME est en précommande (dispo partout ce vendredi)✨\nhttps://t.co/o6pvgCi3il https://t.co/gQUFvjxPmF", "OUCHiNI ON YOUR BLOCK \npop up store le 3 décembre \nparking 30 Boulevard de Belleville 75020 11h-20h 👀", "Alors, CIVILISATION PERDUE, Masterclass ou Finito?\n\nhttps://t.co/enhjTg2eeR", "On organise un tournoi de Civilisation Fighters sur la tournée d’automne!!\nInscrivez-vous ici: https://t.co/nGgHgA8XQb https://t.co/WHaHMYS0zZ", "CIVILISATION ÉDITION ULTIME est disponible en précommande\n-&gt; https://t.co/enhjTfLbcR https://t.co/CERtYTbaPE", "CIVILISATION ÉDITION ULTIME - 28.10.22\n🌑CIVILISATION\n🌐CIVILISATION PERDUE https://t.co/Y6FciUH8pB", "Y a pas le son, mais ça parle sûrement d’astrologie magique", "La partie 2 de Montre jamais ça à personne est dispo sur @PrimeVideoFR ☀️ https://t.co/Qe9n4ua74n", "Si vous avez des galères pour vous connecter y a @PrimeVideoFR qui est là", "Session de rattrapage gratos pour ceux qui n’ont pas vu la première partie!! C’est dispo jusqu’à mercredi prochain https://t.co/8d3jygzhSJ", "La suite de Montre jamais ça à personne sort le 13 octobre ✨✨ Bien évidemment toujours réalisé par @ClementCotentin et dispo sur @PrimeVideoFR https://t.co/aD5IKFUWRE", "Nouvelle Défense Arena✨", "Les deux dates à la Défense Arena sont complètes. 🤯 Alors on en rajoute une le 8 décembre. \nLes PLACES seront mises en vente DEMAIN à MIDI sur https://t.co/3NisuDOdVg https://t.co/0KnI0ZoqX8", "Premier vrai clip en feat ✨🥂💫", "Ensemble, réalisé par Quentin Deronzier, dès maintenant sur vos écrans\ncc @skreadofficial @quentinderonz \n-&gt; https://t.co/ur92aAVjLh https://t.co/ef5xlJUggy", "Deux fois plus de pluie. C était incroyable, merci bro pour le show magnifique. J ai encore des étoiles dans les yeux (et les oreilles) !"]